&НаКлиенте
Процедура ОбновитьИтоги() Экспорт
	Объект.СуммаПоДокументу = Объект.СписокНоменклатуры.Итог("Сумма");
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыКоличествоПриИзменении(Элемент)
	ТекущиеДанные = Элементы.СписокНоменклатуры.ТекущиеДанные;
	ОбщегоНазначения.ПересчетСуммы(ТекущиеДанные, Истина, ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыЦенаПриИзменении(Элемент)
	ТекущиеДанные = Элементы.СписокНоменклатуры.ТекущиеДанные;
	ОбщегоНазначения.ПересчетСуммы(ТекущиеДанные, Истина, ЭтотОбъект);
КонецПроцедуры
