
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Запрос = Новый Запрос;
	МенеджерВТ = Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РасходнаяНакладнаяСписокНоменклатуры.Номенклатура КАК Номенклатура,
	|	СУММА(РасходнаяНакладнаяСписокНоменклатуры.Количество) КАК Количество
	|ПОМЕСТИТЬ втТЧТовары
	|ИЗ
	|	Документ.РасходнаяНакладная.СписокНоменклатуры КАК РасходнаяНакладнаяСписокНоменклатуры
	|ГДЕ
	|	РасходнаяНакладнаяСписокНоменклатуры.Ссылка = &Ссылка
	|	И РасходнаяНакладнаяСписокНоменклатуры.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.Товар)
	|
	|СГРУППИРОВАТЬ ПО
	|	РасходнаяНакладнаяСписокНоменклатуры.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТЧТовары.Номенклатура КАК Номенклатура,
	|	втТЧТовары.Количество КАК Количество,
	|	&Период КАК Период,
	|	&Склад КАК Склад,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения
	|ИЗ
	|	втТЧТовары КАК втТЧТовары";
	
	Запрос.УстановитьПараметр("Период", Дата);
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Движение = Движения.ОстаткиНоменклатуры.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, Выборка);
	КонецЦикла;
		
	Движения.ОстаткиНоменклатуры.Записывать = Истина; 
	Движения.ОстаткиНоменклатуры.БлокироватьДляИзменения = Истина;
	Движения.ОстаткиНоменклатуры.Записать();
		
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиНоменклатурыОстатки.Номенклатура.Представление КАК НоменклатураПредставление,
		|	ОстаткиНоменклатурыОстатки.КоличествоОстаток КАК КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.ОстаткиНоменклатуры.Остатки(
		|			&Граница,
		|			Номенклатура В
		|					(ВЫБРАТЬ
		|						Т.Номенклатура
		|					ИЗ
		|						втТЧТовары КАК Т)
		|				И Склад = &Склад) КАК ОстаткиНоменклатурыОстатки,
		|	Документ.РасходнаяНакладная.СписокНоменклатуры КАК РасходнаяНакладнаяСписокНоменклатуры
		|ГДЕ
		|	ОстаткиНоменклатурыОстатки.КоличествоОстаток < 0";
	
	Запрос.УстановитьПараметр("Граница", Новый Граница(МоментВремени(), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Склад", Склад);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда 
		Отказ = Истина;
		
	    ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	    Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		    Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон("Недостаточно товара %1 в количестве %2 на складе %3", ВыборкаДетальныеЗаписи.НоменклатураПредставление, 
			Склад, -ВыборкаДетальныеЗаписи.КоличествоОстаток);
			Сообщение.Сообщить();
	    КонецЦикла;
		
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	
	НачатьТранзакцию();
	
	Попытка
	    Блокировка = Новый БлокировкаДанных;
	    ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.СебестоимостьСписания");
	    ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	    ЭлементБлокировки.ИсточникДанных = СписокНоменклатуры;
	    ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура", "Номенклатура");
	    Блокировка.Заблокировать(); 
		
		Движения.СебестоимостьСписания.Записывать = Истина;
	
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	    // Данный фрагмент построен конструктором.
	    // При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	    Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	    Запрос.Текст = 
		    "ВЫБРАТЬ
		    |	УчетнаяПолитика.МетодСписания КАК МетодСписания
		    |ПОМЕСТИТЬ ВтДок
		    |ИЗ
		    |	РегистрСведений.УчетнаяПолитика.СрезПоследних(&Период, ) КАК УчетнаяПолитика
		    |;
		    |
		    |////////////////////////////////////////////////////////////////////////////////
		    |ВЫБРАТЬ
		    |	втТЧТовары.Номенклатура КАК Номенклатура,
		    |	втТЧТовары.Номенклатура.Представление КАК НоменклатураПредставление,
		    |	втТЧТовары.Количество КАК Количество,
		    |	СебестоимостьСписанияОстатки.Партия КАК Партия,
		    |	ЕСТЬNULL(СебестоимостьСписанияОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток,
		    |	ЕСТЬNULL(СебестоимостьСписанияОстатки.СтоимостьОстаток, 0) КАК СтоимостьОстаток,
		    |	ВтДок.МетодСписания КАК МетодСписания,
		    |	СебестоимостьСписанияОстатки.Партия.Представление КАК ПартияПредставление
		    |ИЗ
		    |	втТЧТовары КАК втТЧТовары
		    |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СебестоимостьСписания.Остатки(
		    |				&МоментВремени,
		    |				Номенклатура В
		    |					(ВЫБРАТЬ
		    |						втТЧТовары.Номенклатура КАК Номенклатура
		    |					ИЗ
		    |						втТЧТовары КАК втТЧТовары)) КАК СебестоимостьСписанияОстатки
		    |		ПО втТЧТовары.Номенклатура = СебестоимостьСписанияОстатки.Номенклатура
			|       ЛЕВОЕ СОЕДИНЕНИЕ ВтДок КАК ВтДок ПО (ИСТИНА)    
		    |
		    |УПОРЯДОЧИТЬ ПО
		    |	Номенклатура,
		    |	ВЫБОР
		    |		КОГДА ВтДок.МетодСписания = ЗНАЧЕНИЕ(Перечисление.УчетнаяПолитика.ФИФО)
		    |			ТОГДА СебестоимостьСписанияОстатки.Партия.МоментВремени
		    |		ИНАЧЕ ДАТАВРЕМЯ(3999, 12, 31)
		    |	КОНЕЦ,
		    |	ВЫБОР
		    |		КОГДА ВтДок.МетодСписания = ЗНАЧЕНИЕ(Перечисление.УчетнаяПолитика.ЛИФО)
		    |			ТОГДА СебестоимостьСписанияОстатки.Партия.МоментВремени
		    |		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
		    |	КОНЕЦ УБЫВ
		    |ИТОГИ
		    |	МАКСИМУМ(Количество),
		    |	СУММА(КоличествоОстаток),
		    |	СУММА(СтоимостьОстаток)
		    |ПО
		    |	Номенклатура"; 
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Запрос.УстановитьПараметр("Склад", Склад); 
		Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
		Запрос.УстановитьПараметр("Период", Дата);
					
	    РезультатЗапроса = Запрос.Выполнить();
		
		Если РезультатЗапроса.Пустой() Тогда
			Сообщить("Не указан метод списания себестоимости");
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
		ВыборкаНоменклатура = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаНоменклатура.Следующий() Цикл 
						
			КоличествоСписать = ВыборкаНоменклатура.Количество;
	        ВыборкаДетальныеЗаписи = ВыборкаНоменклатура.Выбрать();
			Себестоимость = 0;
	
	        Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		        Количество = Мин(КоличествоСписать, ВыборкаДетальныеЗаписи.КоличествоОстаток);
					
		        Если Количество = ВыборкаДетальныеЗаписи.КоличествоОстаток Тогда
			        Себестоимость = ВыборкаДетальныеЗаписи.СтоимостьОстаток;
				Иначе
			        Себестоимость = ВыборкаДетальныеЗаписи.СтоимостьОстаток / ВыборкаДетальныеЗаписи.КоличествоОстаток * Количество; 
				КонецЕсли;
				Сообщить(ВыборкаДетальныеЗаписи.Номенклатура);
				Сообщить(ВыборкаДетальныеЗаписи.Партия);
				Сообщить(ВыборкаДетальныеЗаписи.СтоимостьОстаток);
				Сообщить(ВыборкаДетальныеЗаписи.КоличествоОстаток);
				Сообщить(ВыборкаДетальныеЗаписи.Количество);
							
		        Движение = Движения.СебестоимостьСписания.Добавить();
		        Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		        Движение.Период = Дата;
		        Движение.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
		        Движение.Партия = ВыборкаДетальныеЗаписи.Партия;
		        Движение.Количество = Количество;
		        Движение.Стоимость = Себестоимость;
				
				КоличествоСписать = КоличествоСписать - Количество;
				
				Если КоличествоСписать <= 0 Тогда
					Прервать;
				КонецЕсли;
		
			КонецЦикла;
			
		КонецЦикла;
		
		Движения.СебестоимостьСписания.Записать();

		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		Отказ = Истина;
		Сообщить(ОписаниеОшибки());
		ВызватьИсключение;
		
	КонецПопытки;
КонецПроцедуры;	
